---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType.TransferSwitch
enum: Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType
source: html/e8d6a74d-1b0e-5b79-a57b-5dab3e4d2d36.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNodeType.TransferSwitch

Transfer Switch